Repository: pypi-data/pypi-mirror-222
Catalog: packages/pretix-sumup/pretix-sumup-1.0.7.tar.gz/pretix-sumup-1.0.7/pretix_sumup/locale/*/LC_MESSAGES/django.po
Languages: it

source: Sumup for Pretix
it: Sumup per Pretix

source: Sumup Payment
it: Pagamento Sumup

source: Please fill and click on Pay in the Sumup widget
it: Si prega di compilare e fare clic su Paga nel widget Sumup

source: In test mode, you can just manually mark this order as paid in the backend after it has been created.
it: In modalità test, puoi semplicemente contrassegnare manualmente questo ordine come pagato nel back-end dopo che è stato creato.

source: This is Sumup Client ID (under your name on the top right of the main Sumup screen)
it: Questo è l'ID client Sumup (sotto il tuo nome in alto a destra nella schermata principale di Sumup)

source: This is Sumup OAuth app Client Secret
it: Questo è il segreto client dell'app Sumup OAuth

source: Sumup Oauth App Client ID
it: ID client dell'app Sumup Oauth

source: Find it in the developer application view
it: Trovalo nella visualizzazione dell'applicazione per sviluppatori

source: Payment OK, get your ticket
it: Pagamento OK, prendi il tuo biglietto

source: You will see the Sumup form after clicking on Continue
it: Vedrai il modulo Sumup dopo aver cliccato su Continua

source: Sumup plugin is a payment plugin for enabling online payment via Sumup. Note that you will need to register an OAuth application and require to the Sumup team to add the 'payment' scope
it: Sumup plugin è un plugin di pagamento per abilitare il pagamento online tramite Sumup. Tieni presente che dovrai registrare un'applicazione OAuth e richiedere al team di Sumup di aggiungere l'ambito di "pagamento"

source: If you have any question don't hesitate to contact us.
it: Se hai qualche domanda non esitare a contattarci.

source: This order has been marked as paid via Sumup Payment manually.
it: Questo ordine è stato contrassegnato come pagato manualmente tramite Sumup Payment.

source: This order has been paid via Sumup Payment.
it: Questo ordine è stato pagato tramite Sumup Payment.

source: This order has been planned to be paid via Sumup Payment, but no payment has been received yet.
it: Questo ordine è stato pianificato per essere pagato tramite Sumup Payment, ma nessun pagamento è stato ancora ricevuto.

source: Merchant ID
it: ID commerciante

source: Payment date
it: Data di pagamento

source: Transaction
it: Transazione

source: Currency
it: Valuta
