Repository: pypi-data/pypi-mirror-222
Catalog: packages/pretix-sumup/pretix-sumup-1.0.3a0.tar.gz/pretix-sumup-1.0.3a0/pretix_sumup/locale/*/LC_MESSAGES/django.po
Languages: es, fr

source: Sumup for Pretix
es: Resumen para Pretix
fr: Sumup pour Pretix

source: Sumup Payment
es: Pago Sumup
fr: Paiement Sumup

source: Please fill and click on Pay in the Sumup widget
es: Por favor, rellene y haga clic en Pagar en el widget Sumup
fr: Veuillez remplir et cliquer sur Payer dans le widget Sumup

source: In test mode, you can just manually mark this order as paid in the backend after it has been created.
es: En el modo de prueba, puede marcar manualmente este pedido como pagado en el backend después de que se haya creado.
fr: En mode test, vous pouvez simplement marquer manuellement cette commande comme payée dans le backend après sa création.

source: This is Sumup Client ID (under your name on the top right of the main Sumup screen)
es: Este es el ID de cliente de Sumup (debajo de su nombre en la parte superior derecha de la pantalla principal de Sumup)
fr: Ceci est l'ID Client Sumup (sous votre nom en haut à droite de l'écran Sumup principal)

source: This is Sumup OAuth app Client Secret
es: Este es el secreto de cliente de la aplicación Sumup OAuth
fr: Ceci est le secret OAuth de l'application Sumup

source: Sumup Oauth App Client ID
es: ID de cliente de la aplicación Sumup Oauth

source: Find it in the developer application view
es: Encuéntrelo en la vista de la aplicación para desarrolladores
fr: Trouvez-le dans la vue application de l'interface développeur

source: Payment OK, get your ticket
es: Pago OK, obtenga su boleto
fr: Paiement ok, obtenez votre billet

source: You will see the Sumup form after clicking on Continue
es: Verá el formulario de resumen después de hacer clic en Continuar
fr: Vous verrez le formulaire Sumup après avoir cliqué sur Continuer

source: Sumup plugin is a payment plugin for enabling online payment via Sumup. Note that you will need to register an OAuth application and require to the Sumup team to add the 'payment' scope
es: El complemento Sumup es un complemento de pago para habilitar el pago en línea a través de Sumup. Tenga en cuenta que deberá registrar una aplicación OAuth y solicitar al equipo de Sumup que agregue el ámbito de "pago"
fr: Le plugin Sumup est un plugin de paiement pour activer le paiement en ligne via Sumup. Notez que vous devrez enregistrer une application OAuth et demander à l'équipe SUPUP pour ajouter le scope 'payment'

source: If you have any question don't hesitate to contact us.
es: Si tiene alguna pregunta no dude en ponerse en contacto con nosotros.
fr: Si vous avez des questions, n’hésitez pas à nous contacter.
