Repository: pypi-data/pypi-mirror-222
Catalog: packages/pretix-sumup/pretix-sumup-1.0.3.tar.gz/pretix-sumup-1.0.3/pretix_sumup/locale/*/LC_MESSAGES/django.po
Languages: de

source: Sumup for Pretix
de: Sumup für Pretix

source: Sumup Payment
de: Sumup Zahlung

source: Please fill and click on Pay in the Sumup widget
de: Bitte füllen Sie das Sumup-Widget aus und klicken Sie auf Bezahlen

source: In test mode, you can just manually mark this order as paid in the backend after it has been created.
de: Im Testmodus können Sie diese Bestellung nach der Erstellung im Backend einfach manuell als bezahlt markieren.

source: This is Sumup Client ID (under your name on the top right of the main Sumup screen)
de: Dies ist die Sumup Client-ID (unter Ihrem Namen oben rechts auf dem Sumup Hauptbildschirm)

source: This is Sumup OAuth app Client Secret
de: Dies ist der geheime Clientschlüssel der Sumup OAuth-App

source: Find it in the developer application view
de: Sie finden es in der Ansicht der Entwickleranwendung

source: Payment OK, get your ticket
de: Bezahlung OK, holen Sie sich Ihr Ticket

source: You will see the Sumup form after clicking on Continue
de: Sie sehen das Sumup Formular, nachdem Sie auf Weiter geklickt haben

source: Sumup plugin is a payment plugin for enabling online payment via Sumup. Note that you will need to register an OAuth application and require to the Sumup team to add the 'payment' scope
de: Das Sumup Plugin ist ein Zahlungs-Plugin zur Ermöglichung von Online-Zahlungen über Sumup. Beachten Sie, dass Sie eine OAuth-Anwendung registrieren und das Sumup Team auffordern müssen, den Bereich "Zahlung" hinzuzufügen

source: If you have any question don't hesitate to contact us.
de: Wenn Sie Fragen haben, zögern Sie nicht, uns zu kontaktieren.
