Repository: pypi-data/pypi-mirror-222
Catalog: packages/askbot/askbot-0.12.2.tar.gz/askbot-0.12.2/askbot/locale/*/LC_MESSAGES/djangojs.po
Languages: pt_br

source: Sorry, you have only read access
pt_br: Você só tem acesso de leitura

source: Type a message
pt_br: Digite uma mensagem

source: Add a recipient
pt_br: Adicione um destinatário

source: message sent
pt_br: mensagem enviada

source: Did you mean to send your message to muliple users? Use comma instead of whitespaces
pt_br: Deseja enviar sua mensagem para vários usuários? Utilize a vírgula no lugar de espaços

source: user {{str}} does not exist
pt_br: O usuário {{str}} não existe

source: cannot send message to yourself
pt_br: não é possível enviar mensagem a si mesmo

source: Are you sure you want to remove your %s login?
pt_br: Tem certeza que deseja remover seu login %s?

source: Please add one or more login methods.
pt_br: Adicione um ou mais métodos de login.

source: You don't have a method to log in right now, please add one or more by clicking any of the icons below.
pt_br: Você não possui um método de login, adicione um ou mais clicando em qualquer um dos ícones abaixo.

source: enter username
pt_br: insira o nome de usuário

source: enter username or email
pt_br: insira o nome de usuário ou e-mail

source: enter password
pt_br: digite a senha

source: passwords do not match
pt_br: as senhas não coincidem

source: Show/change current login methods
pt_br: Mostrar/alterar os métodos de login atuais

source: Please enter your %s, then proceed
pt_br: Digite seu %s, e então prossiga

source: Connect your %(provider_name)s account to %(site)s
pt_br: Conecte sua conta %(provider_name)s ao %(site)s

source: Change your %s password
pt_br: Altere a sua senha de %s

source: Change password
pt_br: Alterar senha

source: Create a password for %s
pt_br: Criar uma senha para %s

source: Create password
pt_br: Criar senha

source: Create a password-protected account
pt_br: Criar uma conta protegida por senha

source: loading...
pt_br: carregando...

source: enter > %(length)s character
pt_br: Digite pelo menos %(length)s caracteres

source: details must have > %s character
pt_br: Digite pelo menos %s caractere a mais

source: tags cannot be empty
pt_br: digite pelo menos uma tag

source: details are required
pt_br: detalhes são obrigatórios

source: enter your question
pt_br: digite sua pergunta

source: content cannot be empty
pt_br: o conteúdo não pode estar em branco

source: Back to the question
pt_br: Voltar à pergunta

source: Load preview
pt_br: Carregar prévia

source: Merge
pt_br: Mesclar

source: Cancel
pt_br: Cancelar

source: draft saved...
pt_br: rascunho salvo...

source: %s follower
pt_br: %s seguidor

source: insufficient privilege
pt_br: privilégios insuficientes

source: please login
pt_br: efetue o login

source: anonymous users cannot subscribe to questions
pt_br: usuários anônimos não podem se inscrever em perguntas

source: anonymous users cannot vote
pt_br: usuários anônimos não podem votar

source: anonymous users cannot flag offensive posts
pt_br: usuários anônimos não podem sinalizar postagens ofensivas

source: confirm delete
pt_br: tem certeza que deseja excluir isto?

source: anonymous users cannot delete/undelete
pt_br: usuários anônimos não podem excluir ou restaurar postagens

source: post recovered
pt_br: sua postagem foi restaurada!

source: post deleted
pt_br: sua postagem foi excluída

source: sorry, you cannot %(accept_own_answer)s
pt_br: você não pode %(accept_own_answer)s

source: remove flag
pt_br: remover sinalização

source: flag offensive
pt_br: sinalizar como ofensivo

source: undelete
pt_br: desfazer exclusão

source: delete
pt_br: excluir

source: sorry, something is not right here
pt_br: algo não está certo aqui

source: Preview: (hide)
pt_br: Prévia: (ocultar)

source: Show preview
pt_br: Exibir prévia

source: add comment
pt_br: adicionar comentário

source: save comment
pt_br: salvar comentário

source: enter at least %s characters
pt_br: digite pelo menos %s caracteres

source: enter at least %s more characters
pt_br: digite pelo menos %s caracteres a mais

source: %s characters left
pt_br: %s caracteres restantes

source: maximum comment length reached
pt_br: tamanho máximo do comentário excedido

source: cancel
pt_br: cancelar

source: minor edit (don't send alerts)
pt_br: edição menor (não enviar alertas)

source: Are you sure you don't want to post this comment?
pt_br: Tem certeza que não deseja postar este comentário?

source: just now
pt_br: agora mesmo

source: delete this comment
pt_br: excluir este comentário

source: confirm delete comment
pt_br: deseja realmente excluir este comentário?

source: please sign in or register to post comments
pt_br: faça o login ou registre-se para postar comentários

source: save
pt_br: salvar

source: Enter the logo url or upload an image
pt_br: Insira a URL do logo ou envie uma imagem

source: Do you really want to remove the image?
pt_br: Deseja realmente remover a imagem?

source: change logo
pt_br: alterar logo

source: add logo
pt_br: adicionar logo

source: tag "%s" was already added, no need to repeat (press "escape" to delete)
pt_br: a tag "%s" já foi adicionada, não é necessário repeti-la (pressione "esc" para excluir)

source: a maximum of %s tag is allowed
pt_br: É permitida %s tag no máximo

source: Delete category?
pt_br: Excluir categoria?

source: edit
pt_br: editar

source: category name cannot be empty
pt_br: o nome da categoria não pode estar em branco

source: already exists at the current level!
pt_br: já existe no nível atual!

source: add category
pt_br: adicionar categoria

source: save tags
pt_br: salvar tags

source: Group name:
pt_br: Nome do grupo:

source: Shared with the following users:
pt_br: Compartilhado com os seguintes usuários:

source: Shared with the following groups:
pt_br: Compartilhado com os seguintes grupos:

source: To see search results, 2 or more characters may be required
pt_br: Para ver os resultados da pesquisa, digite 2 ou mais caracteres

source: Ask Your Question
pt_br: Pergunte aqui

source: Sorry, this tag does not exist
pt_br: Esta tag não existe

source: Tag "<span></span>" matches:
pt_br: Correspondências da tag "<span></span>":

source: and %s more, not shown...
pt_br: e mais %s, não exibidas...

source: Please <a href="%(signin_url)s">signin</a> to follow %(username)s
pt_br: Faça o <a href="%(signin_url)s">login</a> para seguir %(username)s

source: add group
pt_br: adicionar grupo

source: add
pt_br: adicionar

source: Anonymize and Disable Account
pt_br: Anonimizar e Desabilitar Conta

source: Yes, anonymize and disable
pt_br: Sim, anonimizar e desabilitar

source: Are you sure you want to anonymize and disable %(user)s's account?
pt_br: Tem certeza que deseja anonimizar e desabilitar a conta de %(user)s?

source: All posts will remain on the site
pt_br: Todas as postagens permanecerão no site

source: Posts will be attributed to user "%(anon_user)s"
pt_br: As postagens serão atribuídas ao usuário "%(anon_user)s"

source: All %(user)s's personal info will be deleted
pt_br: Toda a informação pessoal de %(user)s será deletada

source: Account will be unusable
pt_br: A conta ficará inutilizável

source: Remove Account
pt_br: Remover Conta

source: Yes, remove account
pt_br: Sim, remover conta

source: All content will be irreversibly deleted.
pt_br: Todo o conteúdo será deletado de forma irreversível.

source: Consider anonymizing the data instead if the content may be useful.
pt_br: Considere anonimizar os dados se o conteúdo puder ser útil.

source: Looks there are some things to fix:
pt_br: Parece que há algo a ser consertado:

source: Please provide description.
pt_br: Forneça a descrição.

source: Please provide details.
pt_br: Forneça detalhes.

source: A reason must be selected to delete one.
pt_br: Selecione um motivo para excluir.

source: Please select at least one item
pt_br: Selecione pelo menos um item

source: Load more items.
pt_br: Carregar mais itens

source: must be shorter than %(max_chars)s character
pt_br: Deve ter menos de %(max_chars)s caractere

source: and
pt_br: e

source: click to close
pt_br: clique para fechar

source: convert to answer
pt_br: converter para resposta

source: click to edit this comment
pt_br: clique para editar este comentário

source: Uploaded file: %s
pt_br: Arquivo gravado: %s

source: Choose a different file
pt_br: Escolha um arquivo diferente

source: Choose a different image
pt_br: Escolha uma imagem diferente

source: Oops, looks like we had an error. Sorry.
pt_br: Oops, parece que temos um erro. Pedimos desculpas.

source: Choose a file to insert
pt_br: Escolha um arquivo para inserir

source: Choose an image to insert
pt_br: Escolha uma imagem para inserir

source: Allowed file types are:
pt_br: Os tipos de arquivos permitidos são:

source: Or paste file url here
pt_br: Ou cole a URL do arquivo aqui

source: group name
pt_br: nome do grupo

source: add new group
pt_br: adicionar novo grupo

source: Group %(name)s already exists. Group names are case-insensitive.
pt_br: O grupo %(name)s já existe. Nomes de grupos não diferenciam maiúsculas de minúsculas.

source: page %s
pt_br: página %s

source: see questions tagged '%s'
pt_br: veja as perguntas marcadas com a tag '%s'

source: Save
pt_br: Salvar

source: saved
pt_br: salvo

source: enabled
pt_br: habilitado

source: disabled
pt_br: desabilitado

source: Feb
pt_br: Fev

source: Apr
pt_br: Abr

source: May
pt_br: Mai

source: Aug
pt_br: Ago

source: Sep
pt_br: Set

source: Oct
pt_br: Out

source: Dec
pt_br: Dez

source: 2 days ago
pt_br: há 2 dias

source: yesterday
pt_br: ontem

source: %s hour ago
pt_br: há %s hora

source: %s min ago
pt_br: há %s min

source: Insert a file
pt_br: Inserir arquivo

source: Insert image
pt_br: Inserir imagem

source: bold
pt_br: negrito

source: italic
pt_br: itálico

source: quote
pt_br: citação

source: preformatted text
pt_br: texto pré-formatado

source: image
pt_br: imagem

source: attachment
pt_br: anexo

source: numbered list
pt_br: lista numerada

source: bulleted list
pt_br: lista com marcadores

source: heading
pt_br: título

source: horizontal bar
pt_br: barra horizontal

source: undo
pt_br: desfazer

source: redo
pt_br: refazer

source: enter image url
pt_br: insira a URL da imagem, por exemplo, http://www.example.com/image.jpg, ou envie um arquivo de imagem

source: enter url
pt_br: insira o endereço da página web, por exemplo, http://www.example.com "título da página"

source: upload file attachment
pt_br: Selecione e envie um arquivo:

source: strong text
pt_br: texto em negrito

source: emphasized text
pt_br: texto com ênfase

source: image description
pt_br: descrição da imagem

source: file name
pt_br: nome do arquivo

source: link text
pt_br: vincular texto

source: enter code here
pt_br: digite o código-fonte aqui

source: List item
pt_br: Item da lista

source: Heading
pt_br: Título de seção
